type Category = {
  title: string;
  subCategories: string[];
};

const dummyFood: Category[] = [
  {
    title: "건강식품",
    subCategories: [
      "건강즙·건강음료",
      "홍삼·인삼·꿀",
      "영양제",
      "유산균",
      "건강분말·건강환",
      "유아동",
    ],
  },

  {
    title: "과일·견과·쌀",
    subCategories: [
      "제철과일",
      "국산과일",
      "수입과일",
      "냉동·건과일",
      "견과류",
      "쌀·잡곡",
    ],
  },
  {
    title: "국·반찬·메인요리",
    subCategories: [
      "국·탕·찌개",
      "밑반찬",
      "김치·장아찌·젓갈",
      "두부·어묵·부침개",
      "햄·소시지·통조림",
      "메인요리",
    ],
  },
  {
    title: "면·양념·오일",
    subCategories: [
      "파스타·면류",
      "밀가루·가루·믹스",
      "향신료·소스·드레싱",
      "양념·액젓·장류",
      "소금·설탕·식초·꿀",
      "식용유·참기름·오일",
    ],
  },
  {
    title: "베이비·키즈",
    subCategories: [
      "분유·간편 이유식",
      "이유식 재료",
      "유아·어린이 음식",
      "간식·음료·건강식품",
      "유아용품·젖병·식기류",
      "기저귀·물티슈",
      "목욕·세제·위생용품",
      "유아스킨·구강케어",
    ],
  },
  {
    title: "베이커리·치즈·델리",
    subCategories: [
      "식빵·빵류",
      "잼·버터·스프레드",
      "케이크·파이·디저트",
      "치즈",
      "건조육",
      "올리브·피클·델리",
    ],
  },
  {
    title: "샐러드·간편식",
    subCategories: [
      "샐러드·도시락",
      "간편식·냉동식품",
      "밥류·면식품·즉석식품",
      "선식·시리얼·그래놀라",
      "만두·튀김·떡볶이",
      "죽·스프",
    ],
  },
  {
    title: "수산·해산·건어물",
    subCategories: [
      "생선류",
      "오징어·낙지·문어",
      "새우·게·랍스터",
      "해산물·조개류",
      "수산가공품",
      "김·미역·해조류",
      "건어물·다시팩",
    ],
  },
  {
    title: "음료·우유·떡·간식",
    subCategories: [
      "생수·음료·주스",
      "커피·차",
      "우유·두유·요거트",
      "아이스크림",
      "떡·한과",
      "간식·과자·쿠키",
      "초콜릿·젤리·캔디",
    ],
  },
  {
    title: "정육·계란",
    subCategories: [
      "소고기",
      "돼지고기",
      "계란류",
      "닭·오리고기",
      "양념육·돈까스",
      "양고기",
    ],
  },
  {
    title: "채소",
    subCategories: [
      "기본채소",
      "쌈·샐러드·간편채소",
      "브로콜리·특수채소",
      "콩나물·버섯류",
      "시금치·부추·나물",
      "양파·마늘·생강·파",
      "파프리카·피망·고추",
    ],
  },
];

const dummyChore: Category[] = [
  { title: "가전제품", subCategories: ["주방가전", "생활가전"] },

  {
    title: "반려동물",
    subCategories: [
      "강아지 간식",
      "강아지 주식",
      "고양이 간식",
      "고양이 주식",
      "반려동물 용품",
    ],
  },

  {
    title: "뷰티·바디케어",
    subCategories: [
      "스킨케어",
      "구강·면도",
      "바디·제모",
      "헤어케어",
      "미용기기·소품",
    ],
  },

  {
    title: "생활용품·리빙",
    subCategories: [
      "휴지·티슈·위생용품",
      "세제·청소용품",
      "인테리어소품",
      "의약외품·마스크",
      "생활잡화·문구",
    ],
  },

  {
    title: "주방용품",
    subCategories: [
      "주방소모품",
      "주방·조리도구",
      "냄비·팬류",
      "식기류",
      "컵·와인잔·사케잔",
      "차·커피도구",
    ],
  },
];

export default {
  food: dummyFood,
  chore: dummyChore,
};
